[
  {
    "content": [
      "Strong foundation in Java, with hands-on experience through academic assignments and mini-projects.",
      "Proficient in object-oriented programming concepts including classes, inheritance, and exception handling.",
      "Built basic backend applications using Spring Boot, focusing on REST APIs and modular design.",
      "Familiar with using development tools like VS Code and the Spring Initializr for setting up and running projects."
    ],
    "imgSrc": "java",
    "title": "Java"
  },
  {
    "content": [
      "Strong understanding of Python programming, with hands-on experience through academic and personal projects.",
      "Completed a machine learning project using Python, involving data preprocessing, model training, and evaluation.",
      "Familiar with popular libraries such as NumPy, Pandas, Matplotlib, and scikit-learn.",
      "Comfortable writing clean, efficient scripts and working with real-world datasets for data analysis and model building."
    ],
    "imgSrc": "python",
    "title": "Python"
  },
  {
    "content": [
      "Good understanding of SQL fundamentals with hands-on experience using PostgreSQL in academic projects.",
      "Used SQL for data storage, retrieval, and manipulation in a machine learning project backend.",
      "Comfortable designing simple relational schemas and connecting PostgreSQL with Python applications."
    ],
    "imgSrc": "sql",
    "title": "SQL"
  },
  {
    "content": [
      "Built the frontend of a web server project, designing responsive and user-friendly interfaces using HTML5 and CSS3",
      "Am open to using any CSS framework or tooling, some of the ones I am familiar with are: Bootstrap, Tailwind CSS.",
      "Focused on semantic HTML and structured content for maintainability and accessibility.",
      "Styled pages with custom CSS, implementing consistent themes, spacing, and basic transitions to enhance user experience."
    ],
    "imgSrc": "css",
    "title": "CSS"
  },
  {
    "content": [
      "Used JavaScript to add interactivity and dynamic behavior to the frontend of a web server project.",
      "Familiar with core concepts like DOM manipulation, event handling, and basic form validation.",
      "Implemented user-friendly features such as input validation, toggle elements, and simple animations.",
      "Currently improving skills in vanilla JavaScript and exploring modern practices like ES6 syntax."
    ],
    "imgSrc": "js",
    "title": "JavaScript"
  },
  {
    "content": [
      "Familiar with basic Linux commands for file handling, directory navigation, and process control.",
      "Used the terminal to compile code, manage project files, and run Python/Java applications.",
      "Gained hands-on experience during development and debugging in a Linux-based environment.",
      "Comfortable working with the command line and understanding the Linux file system structure."
    ],
    "imgSrc": "linux",
    "title": "Linux"
  }
]